src/Catalogs/ПараметрыФормированияСлужебныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПараметрыФормированияСлужебныхЗаданий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоСозданиеЗаданий</Name>
					<Comment>1 - робот создает задание, 0 - пропускает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интервал</Name>
					<Comment>интервал расчета для довыписки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флДополнительнаяДоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели</Name>
					<Comment>"0;0;0;0;0;0;0", в 1С7 было  1-пн, 2-вт, 4-четв (н/п 1;2;4)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели1</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели2</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели3</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели4</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели5</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели6</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДниНедели7</Name>
					<Comment>расписание отправки заказов поставщику</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска5</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска6</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапуска7</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки5</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки6</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаУпаковки7</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки5</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки6</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОкончанияДовыписки7</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки3</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки4</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки5</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки6</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремОтгрузки7</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеУдалятьМинСум7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписывать_только_сток_и_vmi</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСПБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДатыФормированияСлужебныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДатыФормированияСлужебныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПараметрФормированияСЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыФормированияСлужебныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ПараметрыФормированияСлужебныхЗаданий/Ext/ManagerModule.bsl
Функция ЗапроситьИсториюПоПараметру(пар_Ссылка) экспорт
	
	ДтВрмФСЗ = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДатыФормированияЗаказовПоставщикам.ДатаФормирования
	                      |ИЗ
	                      |	РегистрСведений.ДатыФормированияСлужебныхЗаданий КАК ДатыФормированияЗаказовПоставщикам
	                      |ГДЕ
	                      |	ДатыФормированияЗаказовПоставщикам.ПараметрФормированияСЗ = &ПараметрФормированияЗаказовПоставщикам");
	Запрос.УстановитьПараметр("ПараметрФормированияЗаказовПоставщикам", пар_Ссылка);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		ДтВрмФСЗ = Выборка[0].ДатаФормирования;
	КонецЕсли;
	
	Возврат ?( НЕ ДтВрмФСЗ = Неопределено, ?(ДтВрмФСЗ = ДАТА(1,1,1),"Не запускалось",СокрлП(ДтВрмФСЗ)), "ошибка записи");
КонецФункции
	
Процедура ОбновитьВремяОтгрузки_Региональное() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыФормированияСлужебныхЗаданий.Ссылка
	|ИЗ
	|	Справочник.ПараметрыФормированияСлужебныхЗаданий КАК ПараметрыФормированияСлужебныхЗаданий";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.ОбменДанными.Загрузка = Истина;
		
		Для Инд = 1 По 7 Цикл 
			Выполнить("Об.ВремОтгрузки_Региональное" + Инд + " = ПроверкаРазницыВремени.ПолучитьРегиональноеВремя(Об.ВремОтгрузки" + Инд + ", Об.Склад)");
		КонецЦикла;
		Попытка
			Об.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

//+ Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019
Функция ВыгрузитьЭлементы(ТаблицаСсылокНаОбъекты, МетаданныеПланаОбмена, ВыгружаемыеОбъекты = Неопределено) Экспорт
	
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульМенеджера_ВыгрузитьЭлементы";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Результат = Новый Массив;
		
	Если МетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт И ЭтоАктивнаяЗадачаJirа(Справочники.ЗадачиJira.XX2624) Тогда 	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаСсылокНаОбъекты", ТаблицаСсылокНаОбъекты);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВнешняяТаблица.Ссылка
		               |ПОМЕСТИТЬ ЗарегистрированныеОбъекты
		               |ИЗ
		               |	&ТаблицаСсылокНаОбъекты КАК ВнешняяТаблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Т.Ссылка,
		               |	ВЫБОР
		               |		КОГДА Т.Ссылка В
		               |				(ВЫБРАТЬ
		               |					Справочник.ПараметрыФормированияСлужебныхЗаданий.Ссылка
		               |				ИЗ
		               |					Справочник.ПараметрыФормированияСлужебныхЗаданий)
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ИСТИНА
		               |	КОНЕЦ КАК ЭтоУдаление
		               |ПОМЕСТИТЬ Объекты
		               |ИЗ
		               |	ЗарегистрированныеОбъекты КАК Т
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПараметрыФормированияСлужебныхЗаданий.Ссылка,
		               |	ПараметрыФормированияСлужебныхЗаданий.АвтоСозданиеЗаданий
		               |		И НЕ ПараметрыФормированияСлужебныхЗаданий.ПометкаУдаления КАК Включено,
		               |	ПараметрыФормированияСлужебныхЗаданий.Наименование КАК Наименование,
		               |	ПараметрыФормированияСлужебныхЗаданий.Склад КАК Склад,
		               |	ПараметрыФормированияСлужебныхЗаданий.МаршрутДоставки КАК МаршрутДоставки,
		               |	ЕСТЬNULL(ПараметрыФормированияСлужебныхЗаданий.МаршрутДоставки.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладКонечнойРазгрузки,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели1 КАК Включено1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели2 КАК Включено2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели3 КАК Включено3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели4 КАК Включено4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели5 КАК Включено5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели6 КАК Включено6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДниНедели7 КАК Включено7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяЗапуска7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремяНачалаУпаковки7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОкончанияДовыписки7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремОтгрузки_Региональное7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ВремДоставки_Региональное7,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень1,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень2,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень3,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень4,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень5,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень6,
		               |	ПараметрыФормированияСлужебныхЗаданий.ДоставкаНаСледДень7
		               |ИЗ
		               |	Объекты КАК Объекты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПараметрыФормированияСлужебныхЗаданий КАК ПараметрыФормированияСлужебныхЗаданий
		               |		ПО Объекты.Ссылка = ПараметрыФормированияСлужебныхЗаданий.Ссылка
		               |ГДЕ
		               |	НЕ Объекты.ЭтоУдаление
		               |	И ЕСТЬNULL(ПараметрыФормированияСлужебныхЗаданий.МаршрутДоставки.ЭтоСамовывоз, ЛОЖЬ)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Объекты.Ссылка
		               |ИЗ
		               |	Объекты КАК Объекты
		               |ГДЕ
		               |	Объекты.ЭтоУдаление";
		РезультатЗапроса = Запрос.ВыполнитьПакет();
			
		URI = ПланыОбмена.ОбменПартКом83_Сайт.URIПространстваИмен();
		ТипОбъектаXDTO = ФабрикаXDTO.Тип(URI, "Справочники.ПараметрыФормированияСлужебныхЗаданий");
		ТипОбъектаXDTOРасписание = ФабрикаXDTO.Тип(URI, "Справочники.ПараметрыФормированияСлужебныхЗаданий.Расписание");
		
		ТипУдалениеОбъекта = ФабрикаXDTO.Тип(URI, "УдалениеОбъекта");
		Выборка = РезультатЗапроса.Получить(РезультатЗапроса.ВГраница() - 1).Выбрать();
		Пока Выборка.Следующий() Цикл 
			ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
	        ОбъектXDTO.Ссылка = XMLСтрока(Выборка.Ссылка);
	        ОбъектXDTO.Наименование = Выборка.Наименование;
			ОбъектXDTO.Включено = Выборка.Включено;
			ОбъектXDTO.МаршрутДоставки = XMLСтрока(Выборка.МаршрутДоставки);
	        ОбъектXDTO.Склад = XMLСтрока(Выборка.Склад);
			ОбъектXDTO.СкладКонечнойРазгрузки = XMLСтрока(Выборка.СкладКонечнойРазгрузки);
			
			Расписание = ФабрикаXDTO.Создать(ТипОбъектаXDTOРасписание);
			РасписаниеСписок = Расписание.ПолучитьСписок("ДеньНедели");
			МассивРеквизитов = Новый Массив;
			МассивРеквизитов.Добавить("Включено");
			МассивРеквизитов.Добавить("ВремяЗапуска");
			МассивРеквизитов.Добавить("ВремяНачалаУпаковки");
			МассивРеквизитов.Добавить("ВремОкончанияДовыписки");
			МассивРеквизитов.Добавить("ВремОтгрузки");
			МассивРеквизитов.Добавить("ВремОтгрузки_Региональное");
			МассивРеквизитов.Добавить("ВремДоставки_Региональное");
			МассивРеквизитов.Добавить("ДоставкаНаСледДень");
			Для НомерДняНедели = 1 По 7 Цикл
				НоваяСтрока = ФабрикаXDTO.Создать(URI, РасписаниеСписок.ВладеющееСвойство.Тип.Имя);
								РасписаниеСписок.Добавить(НоваяСтрока);
				НоваяСтрока.НомерДняНедели = НомерДняНедели;
				Для Каждого Реквизит Из МассивРеквизитов Цикл 
					НоваяСтрока[Реквизит] = Выборка[Реквизит + Строка(НомерДняНедели)];
				КонецЦикла;
			КонецЦикла;	
			
			ОбъектXDTO.Расписание = Расписание;
			ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(Выборка.Ссылка, ОбъектXDTO);
			Результат.Добавить(ОбъектXDTO);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеквизитыКонтроля(МетаданныеОтбора) Экспорт
	
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульМенеджера_ПолучитьРеквизитыКонтроля";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	

	СтруктураПроверяемыхРеквизитов = Новый Структура;
	
	Если МетаданныеОтбора = ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные() Тогда
		СтруктураПроверяемыхРеквизитов.Вставить("Шапка", 
		               "	АвтоСозданиеЗаданий,
		               |	ПометкаУдаления,
		               |	Склад,
		               |	МаршрутДоставки,
		               |	ДниНедели1,
		               |	ДниНедели2,
		               |	ДниНедели3,
		               |	ДниНедели4,
		               |	ДниНедели5,
		               |	ДниНедели6,
		               |	ДниНедели7,
		               |	ВремяЗапуска1,
		               |	ВремяЗапуска2,
		               |	ВремяЗапуска3,
		               |	ВремяЗапуска4,
		               |	ВремяЗапуска5,
		               |	ВремяЗапуска6,
		               |	ВремяЗапуска7,
		               |	ВремяНачалаУпаковки1,
		               |	ВремяНачалаУпаковки2,
		               |	ВремяНачалаУпаковки3,
		               |	ВремяНачалаУпаковки4,
		               |	ВремяНачалаУпаковки5,
		               |	ВремяНачалаУпаковки6,
		               |	ВремяНачалаУпаковки7,
		               |	ВремОкончанияДовыписки1,
		               |	ВремОкончанияДовыписки2,
		               |	ВремОкончанияДовыписки3,
		               |	ВремОкончанияДовыписки4,
		               |	ВремОкончанияДовыписки5,
		               |	ВремОкончанияДовыписки6,
		               |	ВремОкончанияДовыписки7,
		               |	ВремОтгрузки1,
		               |	ВремОтгрузки2,
		               |	ВремОтгрузки3,
		               |	ВремОтгрузки4,
		               |	ВремОтгрузки5,
		               |	ВремОтгрузки6,
		               |	ВремОтгрузки7,
		               |	ВремОтгрузки_Региональное1,
		               |	ВремОтгрузки_Региональное2,
		               |	ВремОтгрузки_Региональное3,
		               |	ВремОтгрузки_Региональное4,
		               |	ВремОтгрузки_Региональное5,
		               |	ВремОтгрузки_Региональное6,
		               |	ВремОтгрузки_Региональное7,
		               |	ВремДоставки_Региональное1,
		               |	ВремДоставки_Региональное2,
		               |	ВремДоставки_Региональное3,
		               |	ВремДоставки_Региональное4,
		               |	ВремДоставки_Региональное5,
		               |	ВремДоставки_Региональное6,
		               |	ВремДоставки_Региональное7,
		               |	ДоставкаНаСледДень1,
		               |	ДоставкаНаСледДень2,
		               |	ДоставкаНаСледДень3,
		               |	ДоставкаНаСледДень4,
		               |	ДоставкаНаСледДень5,
		               |	ДоставкаНаСледДень6,
		               |	ДоставкаНаСледДень7");
					   
	КонецЕсли;
	
	Возврат СтруктураПроверяемыхРеквизитов;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхМетаданныеОтбора) Экспорт
	
	Возврат	РаботаСПоследовательностямиКлиентСервер.ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхМетаданныеОтбора);
	
КонецФункции
//- Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019

//ХудинВВ XX-3015 26072019
Функция МаршрутДоставкиСоответствуетСкладуОтправленияДляТипаДоставки(ТипДоставки, СкладОтправления, МаршрутДоставки, ТекстОшибки = "", СообщатьОбОшибке = Истина, Отказ = Неопределено) Экспорт
	
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульМенеджера_МаршрутДоставкиСоответствуетСкладуОтправленияДляТипаДоставки";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////

	ВозвращаемоеЗначение = Истина;
	
	Если СкладОтправления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МаршрутДоставки, "Склад") Тогда
		
		ТипДоставкиВерный = ТипДоставки = Справочники.ТипыДоставки.МежскладскаяДоставка ИЛИ ТипДоставки = Справочники.ТипыДоставки.ДоставкаТК;
		
		Если НЕ ТипДоставкиВерный Тогда
			
			ТекстОшибки = "Тип доставки не соответствует заданным параметрам.
			|Для различных складов отправления и назначения тип доставки должен быть ""Межскладская доставка"" или ""Доставка через ТК""";
			
			Если СообщатьОбОшибке Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
			КонецЕсли;
			
			Отказ = Истина;
			
			ВозвращаемоеЗначение = Ложь;
		КонецЕсли;
		
	КонецЕсли;

	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
